src/InformationRegisters/ModulesData.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ModulesData</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>AST</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ParsingDuration</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Module</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GitSHA1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/Jobs_ServerCall/Ext/Module.bsl
Procedure StartJob(Method, Parameters) Export
	
	BackgroundJobs.Execute(Method, Parameters);
	
EndProcedure // StartJob() 

Procedure StartParseProjectModules(Project) Export
	
	Modules = Catalogs.Projects.Modules(Project); 
	
	For Each Module In Modules Do
		
		Parameters = New Array;
		Parameters.Add(Module.Ref);
		
		StartJob("Jobs_ServerCall.ParseModule", Parameters);
		
	EndDo; 
	
EndProcedure // StartParseProjectModules()

Procedure ParseModule(Module) Export
	
	ModuleAttributes = Catalogs.Modules.AttributeValues(Module, "Owner, Path");
	ProjectPath = Catalogs.Projects.AttributeValue(ModuleAttributes.Owner, "Path"); 
	
	FilePath = JoinPath(ProjectPath, ModuleAttributes.Path);
	
	DataReader = New DataReader(FilePath, TextEncoding.UTF8); 
	Source = DataReader.ReadChars();
		
	GitSHA1 = Git.SHA1(Module, Source);
	
	BSLParser = CommonUse.GetDataProcessor("BSLParser");
	Parser = BSLParser.Parser(Mid(Source, 2));
	ParsingStart = CurrentUniversalDateInMilliseconds();
	BSLParser.ParseModule(Parser);
	ParsingDuration = (CurrentUniversalDateInMilliseconds() - ParsingStart) / 1000;
	
	Record = InformationRegisters.ModulesData.CreateRecordManager();
	Record.Module = Module;
	Record.GitSHA1 = GitSHA1;
	Record.AST = New ValueStorage(Parser.Module, New Deflation);
	Record.ParsingDuration = ParsingDuration;
	Record.Write(True);
	
EndProcedure // ParseModule()
